In [5]:
import pandas as pd
import numpy as np
from sklearn import linear_model

In [9]:
df= pd.read_csv('homeprice.csv')
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

In [10]:
# filtering the data by removing the Null values with proper substitute
import math
median_bedroom= math.floor(df.bedrooms.median())
median_bedroom
df.bedrooms= df.bedrooms.fillna(median_bedroom)
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       4.0   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

In [12]:
x=df[['area','bedrooms','age']]
x

   area  bedrooms  age
0  2600       3.0   20
1  3000       4.0   15
2  3200       4.0   18
3  3600       3.0   30
4  4000       5.0    8
5  4100       6.0    8

In [14]:
y=df[['price']]
y

    price
0  550000
1  565000
2  610000
3  595000
4  760000
5  810000

## now lets split our dataset

In [15]:
from sklearn.model_selection import train_test_split

In [16]:
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2)

In [18]:
print("Train size:",len(x_train),"Test size:",len(x_test))

Train size: 4 Test size: 2

In [23]:
x_train

   area  bedrooms  age
5  4100       6.0    8
0  2600       3.0   20
2  3200       4.0   18
3  3600       3.0   30

In [24]:
y_train

    price
5  810000
0  550000
2  610000
3  595000

In [28]:
model= linear_model.LinearRegression()
model.fit(x_train,y_train)

LinearRegression()

In [29]:
model.predict(x_test)

array([[990666.66666667],
       [632166.66666667]])

In [30]:
y_test

    price
4  760000
1  565000

In [31]:
model.score(x_test,y_test)

-2.035817079406815